pkg/wsman/wsmantesting/responses/amt/setupandconfiguration/get.xml

<?xml version="1.0" encoding="UTF-8"?>  
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_SetupAndConfigurationService"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000000332</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_SetupAndConfigurationService</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:AMT_SetupAndConfigurationService>
            <g:CreationClassName>AMT_SetupAndConfigurationService</g:CreationClassName>
            <g:ElementName>Intel(r) AMT Setup and Configuration Service</g:ElementName>
            <g:EnabledState>5</g:EnabledState>
            <g:Name>Intel(r) AMT Setup and Configuration Service</g:Name>
            <g:PasswordModel>1</g:PasswordModel>
            <g:ProvisioningMode>1</g:ProvisioningMode>
            <g:ProvisioningServerOTP>AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=</g:ProvisioningServerOTP>
            <g:ProvisioningState>2</g:ProvisioningState>
            <g:RequestedState>12</g:RequestedState>
            <g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName>
            <g:SystemName>Intel(r) AMT</g:SystemName>
            <g:ZeroTouchConfigurationEnabled>true</g:ZeroTouchConfigurationEnabled>
        </g:AMT_SetupAndConfigurationService>
    </a:Body>
</a:Envelope>